prigorus/Mowgli/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/* \fn wheelTicks_handler
 * \brief Send wheelt tick to openmower by rosserial
 * is called when receiving the motors unit answer (every 20ms)
 */
extern "C" void wheelTicks_handler(int8_t p_u8LeftDirection, int8_t p_u8RightDirection, uint32_t p_u16LeftTicks, uint32_t p_u16RightTicks, int16_t p_s16LeftSpeed, int16_t p_s16RightSpeed)
{
	wheel_ticks_msg.stamp = nh.now();
	wheel_ticks_msg.wheel_tick_factor = TICKS_PER_M;
	wheel_ticks_msg.valid_wheels = 0x0C;
	wheel_ticks_msg.wheel_direction_fl = 0;
	wheel_ticks_msg.wheel_ticks_fl = (int32_t)p_s16LeftSpeed;
	wheel_ticks_msg.wheel_direction_fr = 0;
	wheel_ticks_msg.wheel_ticks_fr = (int32_t)p_s16RightSpeed;
	wheel_ticks_msg.wheel_direction_rl = (p_u8LeftDirection == -1) ? 1 : 0;
	wheel_ticks_msg.wheel_ticks_rl = p_u16LeftTicks;
	wheel_ticks_msg.wheel_direction_rr = (p_u8RightDirection == -1) ? 1 : 0;
	wheel_ticks_msg.wheel_ticks_rr = p_u16RightTicks;

	pubWheelTicks.publish(&wheel_ticks_msg);
}

extern "C" void broadcast_handler()
{
	if (NBT_handler(&imu_nbt))
	{
		////////////////////////////////////////
		// IMU Messages
		////////////////////////////////////////
		imu_msg.header.frame_id = "imu";

		// No Orientation in IMU message
		imu_msg.orientation.x =
		imu_msg.orientation.y = 
		imu_msg.orientation.z = 
		imu_msg.orientation.w = 0;
		imu_msg.orientation_covariance[0] = -1;

		/**********************************/
		/* Exernal Accelerometer 		  */
		/**********************************/
#ifdef EXTERNAL_IMU_ACCELERATION
		// Linear acceleration
		IMU_ReadAccelerometer(&imu_msg.linear_acceleration.x, &imu_msg.linear_acceleration.y, &imu_msg.linear_acceleration.z);
		IMU_AccelerometerSetCovariance(imu_msg.linear_acceleration_covariance);
#else
		imu_msg.linear_acceleration.x = imu_msg.linear_acceleration.y = imu_msg.linear_acceleration.z = 0;
		imu_msg.linear_acceleration_covariance[0] = -1;
#endif
		/**********************************/
		/* Exernal Gyro					  */
		/**********************************/
#ifdef EXTERNAL_IMU_ANGULAR
		// Angular velocity
		IMU_ReadGyro(&imu_msg.angular_velocity.x, &imu_msg.angular_velocity.y, &imu_msg.angular_velocity.z);
		IMU_GyroSetCovariance(imu_msg.angular_velocity_covariance);
#else
		imu_msg.angular_velocity.x = imu_msg.angular_velocity.y = imu_msg.angular_velocity.z = 0;
		imu_msg.angular_velocity_covariance[0] = -1;
#endif
		imu_msg.header.stamp = nh.now();
		pubIMU.publish(&imu_msg);

#ifdef OPTION_PERIMETER
		if (Perimeter_UpdateMsg(&om_perimeter_msg.left,&om_perimeter_msg.center,&om_perimeter_msg.right)) {
			pubPerimeter.publish(&om_perimeter_msg);
		}
#endif
	} // if (NBT_handler(&imu_nbt))

	if (NBT_handler(&status_nbt))
	{
#ifdef ROS_PUBLISH_MOWGLI
		////////////////////////////////////////
		// mowgli/status Message
		////////////////////////////////////////
		status_msg.stamp = nh.now();
		status_msg.rain_detected = RAIN_Sense();
		status_msg.emergency_status = Emergency_State();
		status_msg.emergency_left_stop = HALLSTOP_Left_Sense();
		status_msg.emergency_right_stop = HALLSTOP_Right_Sense();
		status_msg.emergency_tilt_mech_triggered = Emergency_Tilt();
		status_msg.emergency_tilt_accel_triggered = Emergency_LowZAccelerometer();
		status_msg.emergency_left_wheel_lifted = Emergency_WheelLiftBlue();
		status_msg.emergency_right_wheel_lifted = Emergency_WheelLiftRed();
		status_msg.emergency_stopbutton_triggered = Emergency_StopButtonYellow() || Emergency_StopButtonWhite();
		/* not used anymore*/
		status_msg.left_encoder_ticks = DRIVEMOTOR_u32ErrorCnt;
		status_msg.right_encoder_ticks = 0;
		status_msg.v_charge = charge_voltage;
		status_msg.i_charge = current;
		status_msg.v_battery = battery_voltage;
		status_msg.charge_pwm = chargecontrol_pwm_val;
		status_msg.is_charging = chargecontrol_is_charging;
		status_msg.imu_temp = imu_onboard_temperature;
		status_msg.blade_motor_ctrl_enabled = blade_on_off;
		status_msg.drive_motor_ctrl_enabled = true;				// hardcoded for now
		status_msg.blade_motor_enabled = BLADEMOTOR_bActivated; // set by feedback from blademotor
		status_msg.left_power = left_power;
		status_msg.right_power = right_power;
		status_msg.blade_power = BLADEMOTOR_u16Power;
		status_msg.blade_RPM = BLADEMOTOR_u16RPM;
		status_msg.blade_temperature = blade_temperature;
		status_msg.sw_ver_maj = MOWGLI_SW_VERSION_MAJOR;
		status_msg.sw_ver_bra = MOWGLI_SW_VERSION_BRANCH;
		status_msg.sw_ver_min = MOWGLI_SW_VERSION_MINOR;
		pubStatus.publish(&status_msg);
#endif

		om_mower_status_msg.stamp = nh.now();
		om_mower_status_msg.mower_status = mower_msgs::Status::MOWER_STATUS_OK;
		om_mower_status_msg.raspberry_pi_power = true;
		om_mower_status_msg.is_charging = chargecontrol_is_charging;
		om_mower_status_msg.esc_power = true;

		om_mower_status_msg.rain_detected = RAIN_Sense();

		om_mower_status_msg.mow_enabled = target_blade_on_off;
		om_mower_status_msg.mower_esc_status = mower_msgs::ESCStatus::ESC_STATUS_OK;
		om_mower_status_msg.mower_esc_temperature = blade_temperature;
		om_mower_status_msg.mower_esc_current = (float)BLADEMOTOR_u16Power / 1000.0;
		om_mower_status_msg.mower_motor_temperature = blade_temperature;
		om_mower_status_msg.mower_motor_rpm = BLADEMOTOR_u16RPM;
		pubOMStatus.publish(&om_mower_status_msg);

		// Publish Power message to /ll/power
		om_power_msg.stamp = nh.now();
		om_power_msg.battery_voltage_adc = battery_voltage;
		om_power_msg.battery_voltage_chg = battery_voltage;
		om_power_msg.battery_voltage_bms = battery_voltage;
		om_power_msg.charge_voltage_adc = charge_voltage;
		om_power_msg.charge_voltage_chg = charge_voltage;
		om_power_msg.charge_current = current;
		om_power_msg.charger_enabled = chargecontrol_is_charging;
		om_power_msg.charger_status = chargecontrol_is_charging ? "charging" : "idle";
		pubOMPower.publish(&om_power_msg);

		// Publish Emergency message to /ll/emergency
		om_emergency_msg.stamp = nh.now();
		om_emergency_msg.active_emergency = Emergency_State();
		om_emergency_msg.latched_emergency = Emergency_State();
		om_emergency_msg.reason = Emergency_State() ? "emergency" : "";
		pubOMEmergency.publish(&om_emergency_msg);

